app/Http/Controllers/User/MateriController.php

select count(*) as aggregate from `materis` where `judul` not in ('Pre Test', 'Post Test')
select `babs_attempt`.`status` from `babs_attempt` inner join `babs` on `babs_attempt`.`bab_id` = `babs`.`id` where `babs`.`materi_id` = 1 and `babs_attempt`.`status` = 1 and `babs_attempt`.`user_id` = 3
select `latihans_attempt`.`status` from `latihans_attempt` inner join `latihans` on `latihans_attempt`.`latihan_id` = `latihans`.`id` where `latihans`.`materi_id` = 1 and `latihans_attempt`.`status` = 2 and `latihans_attempt`.`user_id` = 3 order by `latihans_attempt`.`updated_at` desc limit 1
---
    public function index()
    {
        $userId = Auth::id();

        $materis = Materi::withCount(['babs', 'latihans'])->whereNotIn('judul', ['Pre Test', 'Post Test'])->orderBy('id', 'ASC')->paginate(5);

        // * Progress Bar
        foreach ($materis as $materi) {
            $materi->total = $materi->babs_count + $materi->latihans_count;

            // Mengambil status babs_attempts dengan status = 1
            $babsAttemptsStatus = DB::table('babs_attempt')
                ->join('babs', 'babs_attempt.bab_id', '=', 'babs.id')
                ->where('babs.materi_id', $materi->id)
                ->where('babs_attempt.status', 1)
                ->where('babs_attempt.user_id', $userId)
                ->select('babs_attempt.status')
                ->get();

            // Mengambil status latihans_attempts dengan status = 2 dan parameter updated_at yang terbaru
            $latihansAttemptsStatus = DB::table('latihans_attempt')
                ->join('latihans', 'latihans_attempt.latihan_id', '=', 'latihans.id')
                ->where('latihans.materi_id', $materi->id)
                ->where('latihans_attempt.status', 2)
                ->where('latihans_attempt.user_id', $userId)
                ->orderByDesc('latihans_attempt.updated_at')
                ->select('latihans_attempt.status')
                ->first();

select * from `materis` where `slug` = 'dhcp-server' limit 1
select * from `kelompoks` where exists (select * from `anggotas` where `kelompoks`.`id` = `anggotas`.`kelompok_id` and `user_id` = 8) limit 1
select * from `kelompoks` where exists (select * from `anggotas` where `kelompoks`.`id` = `anggotas`.`kelompok_id` and `user_id` = 1) limit 1
select * from `sintaks` where `materi_id` = 1 and `kelompok_id` = 9
select * from `sintaks` where `materi_id` = 1 and `kelompok_id` = 10
---
    public function tampilkanSintaks($slug)
    {
        // Ambil materi berdasarkan slug
        $materi = Materi::where('slug', $slug)->firstOrFail();

        // Ambil kelompok berdasarkan user yang sedang login
        $kelompok = Kelompok::whereHas('anggotas', function($query) {
            $query->where('user_id', auth()->id());
        })->first();

        // Jika kelompok tidak ditemukan, redirect ke halaman lain
        if (!$kelompok) {
            return redirect()->route('user.materi.sintaks')->with('error', 'Anda tidak tergabung dalam kelompok.');
        }

        // Ambil sintaks berdasarkan materi_id dan kelompok_id
        $sintaks = Sintaks::where('materi_id', $materi->id)
                          ->where('kelompok_id', $kelompok->id)
                          ->get();

select * from `materis` where `slug` = 'dhcp-server' limit 1
select * from `kelompoks` where exists (select * from `anggotas` where `kelompoks`.`id` = `anggotas`.`kelompok_id` and `user_id` = 8) limit 1
select * from `kelompoks` where exists (select * from `anggotas` where `kelompoks`.`id` = `anggotas`.`kelompok_id` and `user_id` = 3) limit 1
select * from `anggotas` where `anggotas`.`kelompok_id` = 9 and `anggotas`.`kelompok_id` is not null
select * from `sintaks` where `materi_id` = 1 and `kelompok_id` = 10 and `status_tahap` = 'tahap_7' limit 1
select * from `sintaks` where (`materi_id` = 1 and `kelompok_id` = 9 and `status_tahap` = 'tahap_1') limit 1
---
    public function tahap7($slug)
    {
        // Ambil materi berdasarkan slug
        $materi = Materi::where('slug', $slug)->firstOrFail();

        // Ambil kelompok berdasarkan user yang sedang login
        $kelompok = Kelompok::whereHas('anggotas', function($query) {
            $query->where('user_id', auth()->id());
        })->first();

        // Jika kelompok tidak ditemukan, redirect ke halaman lain dengan pesan error
        if (!$kelompok) {
            return redirect()->route('user.materi.sintaks')->with('error', 'Anda tidak tergabung dalam kelompok.');
        }

        // Ambil sintaks tahap 7
        $sintaks = Sintaks::where('materi_id', $materi->id)
            ->where('kelompok_id', $kelompok->id)
            ->where('status_tahap', 'tahap_7')
            ->first();

        // Jika tidak ada sintaks untuk kelompok ini (pertama kali mengerjakan), buat sintaks baru
        if (!$sintaks) {
            $sintaks = new Sintaks();
            $sintaks->materi_id = $materi->id;
            $sintaks->kelompok_id = $kelompok->id;
            $sintaks->status_tahap = 'tahap_7';
            $sintaks->status_validasi = 'pending'; // Status awal: pending
            $sintaks->save();  // Simpan sintaks baru

            return redirect()->route('user.materi.tahap7', $materi->slug)
                            ->with('success', 'Silakan meminta penilaian dari guru.');

select * from `kelompoks` where exists (select * from `anggotas` where `kelompoks`.`id` = `anggotas`.`kelompok_id` and `user_id` = 8) limit 1
select * from `materis` where `slug` = 'dhcp-server' limit 1
---
    public function mintaPenilaian(Request $request, $slug)
    {
        // Ambil materi berdasarkan slug
        $materi = Materi::where('slug', $slug)->firstOrFail();

        // Ambil kelompok berdasarkan user yang sedang login
        $kelompok = Kelompok::whereHas('anggotas', function($query) {
            $query->where('user_id', auth()->id());
        })->first();

        // Jika kelompok tidak ditemukan, redirect ke halaman lain dengan pesan error
        if (!$kelompok) {
            return redirect()->route('user.materi.sintaks')->with('error', 'Anda tidak tergabung dalam kelompok.');
        }

        // Ambil sintaks tahap 7
        $sintaks = Sintaks::where('materi_id', $materi->id)
            ->where('kelompok_id', $kelompok->id)
            ->where('status_tahap', 'tahap_7')
            ->firstOrFail();

        // Update status validasi menjadi 'pending'
        $sintaks->status_validasi = 'pending';
        $sintaks->save();

        return redirect()->route('user.materi.tahap7', $materi->slug)
                        ->with('success', 'Permintaan penilaian telah dikirim.');

select * from `materis` where `slug` = 'dhcp-server' limit 1
select * from `kelompoks` where exists (select * from `anggotas` where `kelompoks`.`id` = `anggotas`.`kelompok_id` and `user_id` = 8) limit 1
select * from `sintaks` where `materi_id` = 1 and `kelompok_id` = 10 and `status_tahap` = 'tahap_6' limit 1
insert into `sintaks` (`materi_id`, `kelompok_id`, `status_tahap`, `updated_at`, `created_at`) values (1, 10, 'tahap_5', '2025-01-23 22:53:25', '2025-01-23 22:53:25')
select * from `sintaks` where `materi_id` = 1 and `kelompok_id` = 10 and `status_tahap` = 'tahap_5' limit 1
---
    public function tahap6($slug)
    {
        // Ambil materi berdasarkan slug
        $materi = Materi::where('slug', $slug)->firstOrFail();

        // Ambil kelompok berdasarkan user yang sedang login
        $kelompok = Kelompok::whereHas('anggotas', function($query) {
            $query->where('user_id', auth()->id());
        })->first();

        if (!$kelompok) {
            return redirect()->route('user.materi.sintaks')->with('error', 'Anda tidak tergabung dalam kelompok.');
        }

        // Ambil atau buat sintaks tahap 6
        $sintaks = Sintaks::where('materi_id', $materi->id)
            ->where('kelompok_id', $kelompok->id)
            ->where('status_tahap', 'tahap_6')
            ->first();

        if (!$sintaks) {
            $sintaks = new Sintaks();
            $sintaks->materi_id = $materi->id;
            $sintaks->kelompok_id = $kelompok->id;
            $sintaks->status_tahap = 'tahap_6';
            $sintaks->save();  // Simpan sintaks baru

            return redirect()->route('user.materi.tahap6', $materi->slug)
                            ->with('success', 'Silakan mulai mengerjakan tahap 6.');

select * from `materis` where `slug` = 'dhcp-server' limit 1
select * from `kelompoks` where exists (select * from `anggotas` where `kelompoks`.`id` = `anggotas`.`kelompok_id` and `user_id` = 3) limit 1
select * from `kelompoks` where exists (select * from `anggotas` where `kelompoks`.`id` = `anggotas`.`kelompok_id` and `user_id` = 8) limit 1
select * from `sintaks` where `materi_id` = 1 and `kelompok_id` = 9 and `status_tahap` = 'tahap_4' limit 1
---
    public function simpanTahap6(Request $request, $slug)
    {
        // Validasi upload file (opsional)
        $request->validate([
            'file_proyek' => 'nullable|file|mimes:pdf,docx,xlsx|max:10240', // File proyek (opsional)
            'file_laporan' => 'nullable|file|mimes:pdf,docx,xlsx|max:10240', // File laporan (opsional)
        ]);

        // Ambil materi berdasarkan slug
        $materi = Materi::where('slug', $slug)->firstOrFail();

        // Ambil kelompok berdasarkan user yang sedang login
        $kelompok = Kelompok::whereHas('anggotas', function($query) {
            $query->where('user_id', auth()->id());
        })->first();

        if (!$kelompok) {
            return redirect()->route('user.materi.sintaks')->with('error', 'Anda tidak tergabung dalam kelompok.');
        }

        // Ambil sintaks tahap 6
        $sintaks = Sintaks::where('materi_id', $materi->id)
            ->where('kelompok_id', $kelompok->id)
            ->where('status_tahap', 'tahap_6')
            ->firstOrFail();

select * from `materis` where `slug` = 'dhcp-server' limit 1
---
        // Simpan perubahan ke database
        $sintaks->save();

        return redirect()->route('user.materi.tahap6', ['slug' => $slug])->with('success', 'File berhasil diupload.');

select * from `kelompoks` where exists (select * from `anggotas` where `kelompoks`.`id` = `anggotas`.`kelompok_id` and `user_id` = 3) limit 1
select * from `anggotas` where `anggotas`.`kelompok_id` = 10 and `anggotas`.`kelompok_id` is not null
select * from `sintaks` where (`materi_id` = 1 and `kelompok_id` = 9 and `status_tahap` = 'tahap_4') limit 1
select * from `materis` where `slug` = 'dhcp-server' limit 1
---
    public function simpanTahap5(Request $request, $slug)
    {
        // Ambil materi berdasarkan slug
        $materi = Materi::where('slug', $slug)->firstOrFail();

        // Ambil kelompok berdasarkan user yang sedang login
        $kelompok = Kelompok::whereHas('anggotas', function($query) {
            $query->where('user_id', auth()->id());
        })->first();

        if (!$kelompok) {
            return redirect()->route('user.materi.sintaks')->with('error', 'Anda tidak tergabung dalam kelompok.');
        }

        // Ambil sintaks tahap 5
        $sintaks = Sintaks::where('materi_id', $materi->id)
            ->where('kelompok_id', $kelompok->id)
            ->where('status_tahap', 'tahap_5')
            ->firstOrFail();

        // Update status To-Do List
        $toDoList = json_decode($sintaks->to_do_list, true); // Decode JSON ke array
        foreach ($request->to_do_list as $key => $task) {
            $toDoList[$key]['status'] = $task['status'];
        }

        // Konversi array ke JSON sebelum disimpan
        $sintaks->to_do_list = json_encode($toDoList);
        $sintaks->save();

        return redirect()->route('user.materi.tahap5', $materi->slug)
                        ->with('success', 'Status tugas berhasil diperbarui.');

select * from `kelompoks` where exists (select * from `anggotas` where `kelompoks`.`id` = `anggotas`.`kelompok_id` and `user_id` = 8) limit 1
select * from `anggotas` where `anggotas`.`kelompok_id` = 10 and `anggotas`.`kelompok_id` is not null
select * from `sintaks` where `materi_id` = 1 and `kelompok_id` = 10 and `status_tahap` = 'tahap_3' limit 1
---
    public function tahap5($slug)
    {
        // Ambil materi berdasarkan slug
        $materi = Materi::where('slug', $slug)->firstOrFail();

        // Ambil kelompok berdasarkan user yang sedang login
        $kelompok = Kelompok::whereHas('anggotas', function($query) {
            $query->where('user_id', auth()->id());
        })->first();

        if (!$kelompok) {
            return redirect()->route('user.materi.sintaks')->with('error', 'Anda tidak tergabung dalam kelompok.');
        }

        // Ambil sintaks tahap 3 untuk mengambil tugas_anggota
        $sintaksTahap3 = Sintaks::where('materi_id', $materi->id)
            ->where('kelompok_id', $kelompok->id)
            ->where('status_tahap', 'tahap_3')
            ->first();

select * from `materis` where `slug` = 'dhcp-server' limit 1
select * from `kelompoks` where exists (select * from `anggotas` where `kelompoks`.`id` = `anggotas`.`kelompok_id` and `user_id` = 8) limit 1
select * from `sintaks` where `materi_id` = 1 and `kelompok_id` = 10 and `status_tahap` = 'tahap_2' limit 1
---
    public function tahap4($slug)
    {
        // Ambil materi berdasarkan slug
        $materi = Materi::where('slug', $slug)->firstOrFail();

        // Ambil kelompok berdasarkan user yang sedang login
        $kelompok = Kelompok::whereHas('anggotas', function($query) {
            $query->where('user_id', auth()->id());
        })->first();

        if (!$kelompok) {
            return redirect()->route('user.materi.sintaks')->with('error', 'Anda tidak tergabung dalam kelompok.');
        }

        $sintaks = Sintaks::where('materi_id', $materi->id)
        ->where('kelompok_id', $kelompok->id)
        ->where('status_tahap', 'tahap_4')
        ->first();

select * from `materis` where `materis`.`id` in (1)
---
    public function simpanTahap3(Request $request, $slug)
    {
        // Ambil materi berdasarkan slug
        $materi = Materi::where('slug', $slug)->firstOrFail();

        // Validasi data
        $request->validate([
            'deskripsi_proyek' => 'required|string',
            'tugas_anggota' => 'required|array',
            'tugas_anggota.*' => 'required|string',
        ]);

        // Ambil kelompok berdasarkan user yang sedang login
        $kelompok = Kelompok::whereHas('anggotas', function($query) {
            $query->where('user_id', auth()->id());
        })->first();

        if (!$kelompok) {
            return redirect()->route('user.materi.sintaks')->with('error', 'Anda tidak tergabung dalam kelompok.');

select * from `materis` where `slug` = 'dhcp-server' limit 1
select * from `kelompoks` where exists (select * from `anggotas` where `kelompoks`.`id` = `anggotas`.`kelompok_id` and `user_id` = 8) limit 1
select * from `sintaks` where `materi_id` = 1 and `kelompok_id` = 10 and `status_tahap` = 'tahap_2' limit 1
---
    public function tahap2($slug)
    {
        // Ambil materi berdasarkan slug
        $materi = Materi::where('slug', $slug)->firstOrFail();

        // Ambil kelompok berdasarkan user yang sedang login
        $kelompok = Kelompok::whereHas('anggotas', function($query) {
            $query->where('user_id', auth()->id());
        })->first();

        // Jika kelompok tidak ditemukan, redirect ke halaman lain dengan pesan error
        if (!$kelompok) {
            return redirect()->route('user.materi.sintaks')->with('error', 'Anda tidak tergabung dalam kelompok.');
        }

        // Ambil sintaks berdasarkan materi_id, kelompok_id, dan status_tahap
        $sintaks = Sintaks::where('materi_id', $materi->id)
                          ->where('kelompok_id', $kelompok->id)
                          ->where('status_tahap', 'tahap_2')
                          ->first();

select * from `materis` where `slug` = 'dhcp-server' limit 1
select * from `kelompoks` where exists (select * from `anggotas` where `kelompoks`.`id` = `anggotas`.`kelompok_id` and `user_id` = 8) limit 1
select * from `sintaks` where `materi_id` = 1 and `kelompok_id` = 10 and `status_tahap` = 'tahap_1' limit 1
---
    public function tahap1($slug)
    {
        // Ambil materi berdasarkan slug
        $materi = Materi::where('slug', $slug)->firstOrFail();

        // Ambil kelompok berdasarkan user yang sedang login
        $kelompok = Kelompok::whereHas('anggotas', function($query) {
            $query->where('user_id', auth()->id());
        })->first();

        // Jika kelompok tidak ditemukan, redirect ke halaman lain dengan pesan error
        if (!$kelompok) {
            return redirect()->route('user.materi.sintaks')->with('error', 'Anda tidak tergabung dalam kelompok.');
        }

        // Ambil sintaks berdasarkan materi_id, kelompok_id, dan status_tahap
        $sintaks = Sintaks::where('materi_id', $materi->id)
                          ->where('kelompok_id', $kelompok->id)
                          ->where('status_tahap', 'tahap_1')
                          ->first();

select * from `materis` where `slug` = 'dhcp-server' limit 1
select * from `kelompoks` where exists (select * from `anggotas` where `kelompoks`.`id` = `anggotas`.`kelompok_id` and `user_id` = 8) limit 1
select * from `materis` where `materis`.`id` in (1)
select * from `sintaks` where (`materi_id` = 1 and `kelompok_id` = 10 and `status_tahap` = 'tahap_1') limit 1
select * from `materis` where `materis`.`id` = 1 limit 1
---
    public function simpanTahap1(Request $request, $slug)
    {
        // Ambil materi berdasarkan slug
        $materi = Materi::where('slug', $slug)->firstOrFail();

        // Validasi data
        $request->validate([
            'orientasi_masalah' => 'required|string',
            'rumusan_masalah' => 'required|string',
        ]);

        // Ambil kelompok berdasarkan user yang sedang login
        $kelompok = Kelompok::whereHas('anggotas', function($query) {
            $query->where('user_id', auth()->id());
        })->first();

        if (!$kelompok) {
            return redirect()->route('user.materi.sintaks')->with('error', 'Anda tidak tergabung dalam kelompok.');
        }

        // Menyimpan data tahap 1 atau update jika sudah ada
        $sintak = Sintaks::updateOrCreate(
            [
                'materi_id' => $materi->id,
                'kelompok_id' => $kelompok->id,
                'status_tahap' => 'tahap_1',
            ],
            [
                'orientasi_masalah' => $request->orientasi_masalah,
                'rumusan_masalah' => $request->rumusan_masalah,
                'status_validasi' => 'invalid', // Status validasi awal
            ]
        );

        // Redirect kembali ke halaman daftar sintaks
        return redirect()->route('user.materi.sintaks', ['slug' => $slug])->with('success', 'Tahap 1 berhasil disimpan');

select * from `babs` where `materi_id` = 1
select * from `latihans` where `materi_id` = 1
select * from `babs_attempt` where `user_id` = 3 and `bab_id` in (2)
---
    public function buka($slug)
    {
        $user = Auth::user();

        // Memeriksa apakah user sudah login
        if (!$user) {
            return response()->json(['error' => 'Unauthorized'], 401);
        }

        $materi = Materi::where('slug', $slug)->withCount(['babs', 'latihans'])->firstOrFail();

        $babs = Bab::where('materi_id', $materi->id)->get();

        $latihans = Latihan::where('materi_id', $materi->id)->get();

        $judulMateri = $materi->judul;

        $babAttempts = BabAttempt::where('user_id', $user->id)
            ->whereIn('bab_id', $babs->pluck('id'))
            ->get();

        // Check apakah semua status dalam $babs adalah 1
        $semuaBabsSelesai = $babs->every(function ($bab) {
            return $bab->status == 1;
        });

        // Untuk Latihan sesuai status babAttempts
        $semuaBabAttemptsSelesai = $babs->every(function ($bab) use ($babAttempts) {
            // Temukan BabAttempt yang sesuai dengan Bab tersebut
            $babAttempt = $babAttempts->where('bab_id', $bab->id)->first();

            // Periksa apakah BabAttempt ditemukan dan memiliki status 1
            return $babAttempt && $babAttempt->status == 1;
        });

        // Jika semua status adalah 1, tampilkan latihan
        $bolehLatihan = $semuaBabAttemptsSelesai ? Latihan::where('materi_id', $materi->id)->get() : collect();

select * from `pre_post_tests` where `pre_post_tests`.`pre_post_id` in (6)
select * from `pre_posts` where `judulPrePost` = 'Pre Test'
---
    public function bukaPreTest()
    {
        $user = Auth::user();

        // Memeriksa apakah user sudah login
        if (!$user) {
            return response()->json(['error' => 'Unauthorized'], 401);
        }

        $qnaPreTest = PrePost::where('judulPrePost', 'Pre Test')->with('getPrePostTest')->get();

select * from `pre_post_tests` where `pre_post_id` = 6
select * from `materis` where `materis`.`id` in (1)
select * from `pre_posts` where `judulPrePost` = 'Pre Test' limit 1
---
        if (count($qnaPreTest) > 0) {
            if (count($qnaPreTest[0]['getPrePostTest']) > 0) {

                $qna = PrePostTest::where('pre_post_id', $qnaPreTest[0]['id'])->with('question', 'jawaban')->get();

                $pretests = PrePost::where('judulPrePost', 'Pre Test')->with('materi')->first();

select * from `materis` where `materis`.`id` in (1)
select * from `pre_posts` where `materi_id` = 1 and `id` > '{\"id\":6,\"materi_id\":1,\"judulPrePost\":\"Pre Test\",\"slug\":\"pre-test\",\"created_at\":\"2025-02-08T17:59:23.000000Z\",\"updated_at\":\"2025-02-08T17:59:23.000000Z\",\"materi\":{\"id\":1,\"judul\":\"DHCP Server\",\"slug\":\"dhcp-server\",\"deskripsi\":\"Deskripsi DHCP Server\",\"created_at\":\"2025-01-20T10:38:14.000000Z\",\"updated_at\":\"2025-01-20T10:38:14.000000Z\"}}' order by `id` asc limit 1
select * from `materis` where `materis`.`id` = 1 limit 1
---

                // dd($materiId);

                $nextLatihan = PrePost::where('materi_id', $materiId)->where('id', '>', $pretests)->with('materi')->orderBy('id', 'asc')->first();

                $materis = Materi::findOrFail($materiId)->withCount('preposts')->orderBy('id', 'asc');

select * from `pre_post_tests` where `pre_post_tests`.`pre_post_id` in (7)
select * from `pre_posts` where `judulPrePost` = 'Post Test' limit 1
---
    public function bukaPostTest()
    {
        $user = Auth::user();

        // Memeriksa apakah user sudah login
        if (!$user) {
            return response()->json(['error' => 'Unauthorized'], 401);
        }

        // Ambil data PostTest berdasarkan judul "Post Test"
        $qnaPostTest = PrePost::where('judulPrePost', 'Post Test')->with('getPrePostTest')->get();

select * from `pre_post_tests` where `pre_post_id` = 7
select * from `materis` where `materis`.`id` = 1 limit 1
select * from `pre_posts` where `id` = 4 limit 1
---
        }

        // Jika ada pertanyaan, lanjutkan proses
        $qna = PrePostTest::where('pre_post_id', $qnaPostTest[0]['id'])->with('question', 'jawaban')->get();
        $posttests = PrePost::where('id', 4)->with('materi')->first();
        $materiId = $posttests->materi->id;
        $nextLatihan = PrePost::where('materi_id', $materiId)->where('id', '>', $posttests)->with('materi')->orderBy('id', 'asc')->first();
        $materis = Materi::findOrFail($materiId)->withCount('preposts')->orderBy('id', 'asc');