app/Http/Controllers/Admin/BabController.php

select * from `babs` limit 5 offset 0
select count(*) as aggregate from `babs`
---
    public function index()
    {
        $babs = Bab::paginate(5);

insert into `babs` (`materi_id`, `judul`, `slug`, `isi`, `file_path`, `video_url`, `updated_at`, `created_at`) values ('1', 'zxczxc', 'zxczxc', 'qoritjqroi p23454321', 'uploads/babs/OXUhcNHLc5.pdf', null, '2025-01-20 19:15:03', '2025-01-20 19:15:03')
---
    public function store(BabFormRequest $request)
    {
        $validatedData = $request->validated();

        $filePath = null;
        if ($request->hasFile('file')) {
            $file = $request->file('file');
            $filePath = $file->storeAs('uploads/babs', Str::random(10) . '.' . $file->getClientOriginalExtension(), 'public');
        }

        $videoUrl = $validatedData['video_url'] ?? null;

        $bab = Bab::create([
            'materi_id' => $validatedData['materi_id'],
            'judul' => $validatedData['judul'],
            'slug' => Str::slug($validatedData['judul']),
            'isi' => $validatedData['isi'],
            'file_path' => $filePath,
            'video_url' => $videoUrl,
        ]);

select * from `babs` where `babs`.`id` = 4 limit 1
select * from `materis`
---
    public function edit(int $bab_id)
    {
        $bab = Bab::findOrFail($bab_id);
        $materis = Materi::all();

select * from `babs` where `babs`.`id` = 4 limit 1
---
    public function update(BabFormRequest $request, int $bab_id)
    {
        $validatedData = $request->validated();
        $bab = Bab::findOrFail($bab_id);