app/Http/Controllers/Admin/DashboardController.php

    public function index(Request $request)
    {
        // Data statistik dasar
        $jumlahMateri = Materi::count();
        $jumlahKelompok = Kelompok::count();

        // Hitung total user yang telah menyelesaikan babs_attempt dengan status = 1
        $userCompleted = BabAttempt::where('status', 1)->distinct('user_id')->count('user_id');

        // Hitung total user yang mencoba babs_attempt
        $totalUsersAttempted = BabAttempt::distinct('user_id')->count('user_id');
---
select count(*) as aggregate from `materis`
select count(*) as aggregate from `kelompoks`
select count(distinct `user_id`) as aggregate from `babs_attempt` where `status` = 1
select count(distinct `user_id`) as aggregate from `babs_attempt`