app/Http/Controllers/Admin/LatihanController.php

    public function index()
    {
        $latihans = Latihan::paginate(5);
---
select * from `latihans` limit 5 offset 0
select count(*) as aggregate from `latihans`