app/Http/Controllers/Admin/MateriController.php

    public function index()
    {
        $materis = Materi::withCount('babs')->orderBy('id', 'ASC')->paginate(5);
---
select count(*) as aggregate from `materis`