app/Http/Controllers/Admin/PJBLKelompokController.php

select * from `kelompoks` where `slug` = 'kelompok-2' limit 1
---
    public function update(PJBLKelompokFormRequest $request, string $slug)
    {
        $validatedData = $request->validated();
        $kelompok = Kelompok::where('slug', $slug)->firstOrFail();