app/Http/Controllers/Admin/PjBLController.php

    public function index()
    {
        $kelompoks = Kelompok::paginate(10);
---
select * from `kelompoks`

    public function create()
    {
        $users = User::all();
---
select * from `users`