app/Http/Controllers/Admin/PJBLKelompokController.php

    public function index()
    {
        // Ambil semua kelompok dengan relasi ketua dan anggota
        $kelompok = Kelompok::with('ketua', 'anggotas.user')->paginate(10);
---
select * from `anggotas` where `anggotas`.`kelompok_id` in (9, 10)
select * from `kelompoks` limit 10 offset 0
select * from `ketuas` where `ketuas`.`kelompok_id` in (9, 10)
select * from `users` where `users`.`id` in (3, 5, 8)

    public function create()
    {
        // Ambil siswa yang belum terdaftar sebagai anggota kelompok apapun dan bukan ketua kelompok
        $kelompokAnggota = Anggota::pluck('user_id')->toArray(); // Mendapatkan seluruh anggota dari semua kelompok
        $siswa = User::where('role_as', 0) // Hanya mengambil siswa
                    ->whereNotIn('id', $kelompokAnggota) // Pastikan siswa bukan anggota yang sudah terdaftar
                    ->get();
---
select `user_id` from `anggotas`
select * from `users` where `role_as` = 0 and `id` not in (3, 5)

    public function store(PJBLKelompokFormRequest $request)
    {
        $validatedData = $request->validated();

        $kelompok = Kelompok::create([
            'kelompok' => $validatedData['kelompok'],
            'slug' => Str::slug($validatedData['kelompok']),
        ]);

        if ($kelompok) {
            // Menambahkan anggota dan ketua jika ada
            if ($request->has('anggotas') && count($request->anggotas) > 0) {
                foreach ($request->anggotas as $anggotaId) {
                    Anggota::create([
                        'kelompok_id' => $kelompok->id,
                        'user_id' => $anggotaId,
                    ]);
                }
            }

            if ($request->has('ketua_id')) {
                Ketua::create([
                    'kelompok_id' => $kelompok->id,
                    'user_id' => $request->ketua_id,
                ]);
---
insert into `kelompoks` (`kelompok`, `slug`, `updated_at`, `created_at`) values ('Kelompok 2', 'kelompok-2', '2025-01-22 14:13:39', '2025-01-22 14:13:39')
insert into `anggotas` (`kelompok_id`, `user_id`, `updated_at`, `created_at`) values (8, '5', '2025-01-22 14:13:39', '2025-01-22 14:13:39')
insert into `ketuas` (`kelompok_id`, `user_id`, `updated_at`, `created_at`) values (8, '3', '2025-01-22 14:13:39', '2025-01-22 14:13:39')

    public function edit(string $slug)
    {
        $kelompok = Kelompok::where('slug', $slug)->firstOrFail();
        $anggotas = $kelompok->anggotas()->with('user')->get();  // Menambahkan user untuk anggota
---
select * from `kelompoks` where `slug` = 'kelompok-2' limit 1
select * from `anggotas` where `anggotas`.`kelompok_id` = 3 and `anggotas`.`kelompok_id` is not null

    public function destroy($slug)
    {
        // Temukan kelompok berdasarkan slug
        $kelompok = Kelompok::where('slug', $slug)->first();

        // Pastikan kelompok ditemukan
        if (!$kelompok) {
            alert()->error('Gagal!', 'Kelompok tidak ditemukan.');
            return back();
        }

        // Hapus anggota yang terkait dengan kelompok
        $kelompok->anggotas()->delete();
---
delete from `anggotas` where `anggotas`.`kelompok_id` is null and `anggotas`.`kelompok_id` is not null