app/Http/Controllers/Admin/PJBLSintaksController.php

select * from `materis`
select * from `sintaks` where `sintaks`.`materi_id` in (1)
---
    public function index()
    {
        // Ambil semua materi beserta sintaks
        $materi = Materi::with('sintaks')->get();

select * from `kelompoks` where exists (select * from `sintaks` where `kelompoks`.`id` = `sintaks`.`kelompok_id` and `materi_id` = 1)
---
    public function listKelompok(Materi $materi)
    {
        // Ambil kelompok yang terdaftar di materi tertentu
        $kelompok = Kelompok::whereHas('sintaks', function($query) use ($materi) {
            $query->where('materi_id', $materi->id);
        })->get();

select * from `sintaks` where `materi_id` = 1 and `kelompok_id` = 10
---
    public function detailSintaks(Materi $materi, Kelompok $kelompok)
    {
        $anggotaKelompok = $kelompok->anggotas;
        $sintaks = Sintaks::where('materi_id', $materi->id)
                          ->where('kelompok_id', $kelompok->id)
                          ->get(); // Ambil semua sintaks kelompok di materi tertentu

select * from `sintaks` where `materi_id` = 1 and `kelompok_id` = 10 and `status_tahap` = 'tahap_1' limit 1
---
    public function validasiTahap(Request $request, Materi $materi, Kelompok $kelompok)
{
    $request->validate([
        'status_tahap' => 'required|in:tahap_1,tahap_2,tahap_3,tahap_4,tahap_5,tahap_6,tahap_7',
        'status_validasi' => 'required|in:valid,invalid,pending',
        'feedback_guru' => 'nullable|string',
    ]);

    $sintaks = Sintaks::where('materi_id', $materi->id)
                      ->where('kelompok_id', $kelompok->id)
                      ->where('status_tahap', $request->status_tahap)
                      ->firstOrFail();