app/Http/Controllers/Admin/PrePostTestController.php

select * from `pre_posts` limit 5 offset 0
select count(*) as aggregate from `pre_posts`
---
    public function index()
    {
        $preposts = PrePost::paginate(5);