app/Http/Controllers/Admin/PrePostController.php

    public function index()
    {
        $preposts = PrePost::paginate(5);
---
select * from `pre_posts` limit 5 offset 0
select count(*) as aggregate from `pre_posts`