app/Http/Controllers/Admin/RiwayatController.php

select * from `users` where `users`.`id` = 5 limit 1
select count(*) as aggregate from `materis` where `judul` in ('Pre Test', 'Post Test')
select * from `pre_posts` where `judulPrePost` in ('Pre Test', 'Post Test')
select count(*) as aggregate from `materis` where `judul` not in ('Pre Test', 'Post Test')
select `babs_attempt`.`status` from `babs_attempt` inner join `babs` on `babs_attempt`.`bab_id` = `babs`.`id` where `babs`.`materi_id` = 1 and `babs_attempt`.`status` = 1 and `babs_attempt`.`user_id` = 5
select `latihans_attempt`.`status` from `latihans_attempt` inner join `latihans` on `latihans_attempt`.`latihan_id` = `latihans`.`id` where `latihans`.`materi_id` = 1 and `latihans_attempt`.`status` = 2 and `latihans_attempt`.`user_id` = 5 order by `latihans_attempt`.`updated_at` desc limit 1
---
    public function cekProgress(int $user)
    {
        $user = User::findOrFail($user);

        $matery = Materi::withCount(['babs', 'latihans'])
            ->whereIn('judul', ['Pre Test', 'Post Test'])
            ->orderBy('id', 'ASC')
            ->paginate(10);

        $preposts = PrePost::whereIn('judulPrePost', ['Pre Test', 'Post Test'])->get();

        // dd($preposts);

        $materis = Materi::withCount(['babs', 'latihans'])->whereNotIn('judul', ['Pre Test', 'Post Test'])->orderBy('id', 'ASC')->paginate(10);

        // * Progress Bar
        foreach ($materis as $materi) {
            $materi->total = $materi->babs_count + $materi->latihans_count;

            // Mengambil status babs_attempts dengan status = 1
            $babsAttemptsStatus = DB::table('babs_attempt')
                ->join('babs', 'babs_attempt.bab_id', '=', 'babs.id')
                ->where('babs.materi_id', $materi->id)
                ->where('babs_attempt.status', 1)
                ->where('babs_attempt.user_id', $user->id)
                ->select('babs_attempt.status')
                ->get();

            // Mengambil status latihans_attempts dengan status = 2 dan parameter updated_at yang terbaru
            $latihansAttemptsStatus = DB::table('latihans_attempt')
                ->join('latihans', 'latihans_attempt.latihan_id', '=', 'latihans.id')
                ->where('latihans.materi_id', $materi->id)
                ->where('latihans_attempt.status', 2)
                ->where('latihans_attempt.user_id', $user->id)
                ->orderByDesc('latihans_attempt.updated_at')
                ->select('latihans_attempt.status')
                ->first();

select * from `users` where `users`.`id` = 5 limit 1
select * from `pre_posts` where `id` = 6 limit 1
---
    public function cekDetail(int $user, int $prepost)
    {
        $userName = User::find($user);

        if (!$userName) {
            abort(404); // Atau tindakan lain yang sesuai dengan kasus Anda
        }

        $pp = PrePost::where('id', $prepost)->first();