app/Http/Controllers/Admin/TestController.php

select count(*) as aggregate from `latihans`
---
    public function index()
    {
        $latihans = Latihan::paginate(5);