app/Http/Controllers/Admin/UserController.php

select * from `users` limit 10 offset 0
select count(*) as aggregate from `users`
---
    public function index()
    {
        $users = User::paginate(10);